unit uConsts_Messages;

interface

const bs_Error               :array[1..2] of String=('Помилка!','Ошибка!');
const OkBtnCaption           :array[1..2] of string=('Ок','Ок');
const CancelBtnCaption       :array[1..2] of string=('Відмінити','Отменить');
const YesBtnCaption          :array[1..2] of string=('Так','Да');
const NoBtnCaption           :array[1..2] of string=('Ні','Нет');
const AbortBtnCaption        :array[1..2] of string=('Перервати','Прервать');
const RetryBtnCaption        :array[1..2] of string=('Повторити','Повторить');
const IgnoreBtnCaption       :array[1..2] of string=('Продовжити','Продолжить');
const AllBtnCaption          :array[1..2] of string=('Всі','Все');
const HelpBtnCaption         :array[1..2] of string=('Допомога','Помощь');
const NoToAllBtnCaption      :array[1..2] of string=('Ні для всіх','Нет для всех');
const YesToAllBtnCaption     :array[1..2] of string=('Так для всіх','Да для всех');

const existsMan              :array[1..2] of string=('Така людина вже додана!','Такой человек уже добавлен!');
const existsKat              :array[1..2] of string=('Така послуга вже додана!','Такая услуга уже добавлен!');
const existsLgots            :array[1..2] of string=('Така пільга вже додана!','Такая льгота уже добавлен!');

const YesFromBufferCaption    :array[1..2] of string=('З буферу','Из буфера');
const NoFromBufferCaption     :array[1..2] of string=('Вручну','Вручную');

const wfLoadPackage_Const    :array[1..2] of string=('Чекайте! Йде пошук та завантаження пакету!','Ждите, идет поиск и загрузка пакета!');
const wfLocateFunction_Const :array[1..2] of string=('Чекайте! Йде пошук функції!','Ждите, идет поиск функции!');
const wfSelectData_Const     :array[1..2] of string=('Чекайте! Йде відбор даних!','Ждите, идет отбор данных!');
const wfPrepareData_Const    :array[1..2] of string=('Чекайте! Йде підготовка даних!','Ждите, идет подготовка данных!');

const bs_warning_PercentSum  :array[1..2] of string=('Сума за відсотками не повинна перевищувати 100 % !','Сумма по процентам не должна превышать 100 % !');
const bs_warning_StageOpl    :array[1..2] of string=('Спочатку треба заповнити осіб, що навчаються та платників!','Сначала необходимо заполнить обущающихся и плательщиков!');


const bs_warningVvod_Percent        :array[1..2] of string=('Відсоток введений невірно!','Процент введен неверно!');
const bs_warningVvod_Code           :array[1..2] of string=('Код введений невірно!','Код введен неверно!');
const bs_warningVvod_Razdel         :array[1..2] of string=('Код розділу введений невірно! Даного розділу не існує.','Код раздела введен неверно! Данного раздела не существует.');
const bs_warningVvod_Stat           :array[1..2] of string=('Код статті введений невірно! Даної статті не існує.','Код статьи введен неверно! Данной статьи не существует.');
const bs_warningVvod_Kekv           :array[1..2] of string=('Код КЕКВ введений невірно! Даного КЕКВ не існує.','Код КЕКЗ введен неверно! Данного КЕКЗ не существует.');
const bs_warningVvod_Smeta          :array[1..2] of string=('Код кошторису введений невірно! Даного кошторису не існує.','Код сметы введен неверно! Данной сметы не существует.');
const bs_warning_PercentMoreThen100 :array[1..2] of string=('Відсоток не може бути більш, ніж 100%','Процент не может быть более 100 %');
const bs_warning_SmRozdStat         :array[1..2] of string=('Сполучення кошторис-розділ-стаття невірно!','Сочетание смета-раздел-статья неверно!');

const bs_warning_SummaNotSame       :array[1..2] of string=('Сума розбивки не співпадає з зазначеною!', 'Сумма разбивки не совпадант с указанной!');

const bs_warning_Delete             :array[1..2] of string=('Ви дійсно хочете видалити цей запис?','Вы действительно хотите удалить эту запись?');
const bs_warning_Execute            :array[1..2] of string=('Ви дійсно хочете виконати цю дію?','Вы действительно хотите выполнить это действие?');

const bs_warning_Preyskurant        :array[1..2] of string=('Вартість навчання за даними параметрами не знайдена. Бажаєте вибрати з прейскуранту?','Стоимость обучения по данным параметрам не найдена. Хотите выбрать из прейскуранта?');

const  bs_Faculty_Need              :array[1..2] of String=('Необхідно заповнити факультет!','Необходимо заполнить факультет!');
const  bs_Spec_Need                 :array[1..2] of String=('Необхідно заповнити спеціальніть!','Необходимо заполнить специальность!');
const  bs_Group_Need                :array[1..2] of String=('Необхідно заповнити групу!','Необходимо заполнить группу!');
const  bs_FormStud_Need             :array[1..2] of String=('Необхідно заповнити форму навчання!','Необходимо заполнить форму обучения!');
const  bs_KatStud_Need              :array[1..2] of String=('Необхідно заповнити категорію навчання!','Необходимо заполнить категорию обучения!');
const  bs_National_Need             :array[1..2] of String=('Необхідно заповнити громадянство!','Необходимо заполнить гражданство!');
const  bs_DateBeg_Need              :array[1..2] of String=('Необхідно заповнити дату початку!','Необходимо заполнить дату начала!');
const  bs_DateEnd_Need              :array[1..2] of String=('Необхідно заповнити дату закінчення!','Необходимо заполнить дату окончания!');
const  bs_Sum_Need                  :array[1..2] of String=('Необхідно заповнити суму!','Необходимо заполнить сумму!');
const  bs_AllData_Need              :array[1..2] of String=('Необхідно заповнити усі дані!','Необходимо заполнить все данные!');

const  bs_Dates_Prohibition         :array[1..2] of String=('Дата початку не може бути більш, ніж дата закінчення!','Дата начала не может быть больше даты окончания!');
const  bs_SummaNotNul_Prohibition   :array[1..2] of String=('Сума не може бути нульовою!', 'Сумма не может быть нулевой!');
const  bs_Period_Prohibition        :array[1..2] of String=('Дата закінчення вийшла за період дії контракту!', 'Дата окончания вышла за период действия контракта!');

const  bs_no_actual_price           :array[1..2] of String=('Немає актуальної версії','Нет актуальной версии');

{Льготы}
const  bs_lg_DateNakaz_Need         :array[1..2] of String=('Необхідно заповнити дату наказу!','Необходимо заполнить дату приказа!');
const  bs_lg_NomNakaz_Need          :array[1..2] of String=('Необхідно заповнити номер наказу!','Необходимо заполнить номер приказа!');
const  bs_lg_SumPerc_Need           :array[1..2] of String=('Необхідно заповнити суму чи відсоток !','Необходимо заполнить сумму или процент!');
const  bs_lg_DateBeg_Need           :array[1..2] of String=('Необхідно заповнити дату початку!','Необходимо заполнить дату начала!');
const  bs_lg_DateEnd_Need           :array[1..2] of String=('Необхідно заповнити дату закінчення!','Необходимо заполнить дату окончания!');

const  bs_PercentPeriods_Cross      :array[1..2] of String=('Періоди з відсотками перетинаються!','Периоды с процентами пересекаются!');
const  bs_SummaPeriods_Cross        :array[1..2] of String=('Періоди з сумами перетинаються!','Периоды с суммами пересекаются!');
const  bs_PercentMore100            :array[1..2] of String=('Відсоток не може перевищувати 100%!','Процент не может превышать 100%!');

const  bs_ShortcutWhosCreate        :array[1..2] of String=('Іконка була успішно створена в: ','Иконка была успешно создана в: ');

const  bs_DateDiss_Need             :array[1..2] of String=('Необхідно заповнити дату розірвання контракту!','Необходимо заполнить дату расторжения контракта!');
const  bs_DateOrder_Need            :array[1..2] of String=('Необхідно заповнити дату наказу!','Необходимо заполнить дату приказа!');
const  bs_NumOrder_Need             :array[1..2] of String=('Необхідно заповнити номер наказу!','Необходимо заполнить номер приказа!');

const  bs_NoDeleteContract          :array[1..2] of String=('Неможливо видалити. За контрактом вже були сплати.','Невозможно удалить. По контракту уже были оплаты.');
const  bs_CheckNumDogFalse          :array[1..2] of String=('Контракт з таким номером вже існує!','Контракт с таким номером уже существует!');

const  bs_NotHaveRights             :array[1..2] of String=('Ви не маєте повноважень для здійснення даної дії!', 'У Вас нет прав для осуществления данного действия!');
const  bs_GoToAdmin                 :array[1..2] of String=('Зверніться до адміністратора.','Обратитесь к администратору.');
const  bs_ActionDenied              :array[1..2] of String=('Дія заборонена','Действие запрещено');

const  bs_Name_Need                 :array[1..2] of String=('Необхідно заповнити найменування !','Необходимо заполнить наименование!');
const  bs_ShortName_Need            :array[1..2] of String=('Необхідно заповнити коротке найменування !','Необходимо заполнить краткое наименование!');
const  bs_Exec_Need                 :array[1..2] of String=('Необхідно заповнити посаду відповідального!','Необходимо заполнить должность ответственного!');
const  bs_Dekan_Need                :array[1..2] of String=('Необхідно заповнити ПІБ відповідального!','Необходимо заполнить ФИО ответственного!');

const  bs_NonDeleteDependet         :array[1..2] of String=('Неможливо видалити - запис має залежні записи','Невозможно удалить - запись имеет зависимые записи');

const  bs_DelAll_Caption            :array[1..2] of String=('Видалити усі','Удалить все');
const  bs_DelAll_Promt              :array[1..2] of String=('Ви дійсно бажаєте видалити усі записи у таблиці ?','Вы действительно желаете удалить все записи из таблицы?');
const  bs_Accounts_Need             :array[1..2] of String=('Необхідно заповнити розрахунковий рахунок!','Необходимо заполнить расчетный счет!');

const  bs_Some_Need                 :array[1..2] of String=('Помилка заповнення даних форми. Не усі поля заповнені','Ошибка заполнения данных формы. Не все поля заполнены');
const  bs_NotChangeRaport           :array[1..2] of String=('Дія заборонена. Рапорт вже виконаний.','Действие запрещено. Рапорт уже выполнен.');
const  bs_MoreDateStart             :array[1..2] of String=('Дата початку не повинна бути меньш, ніж дата запуску системи!',
                                                            'Дата начала не должна быть менее даты запуска системы!');

const  bs_NoDateBegVSBegRozbivka   :array[1..2] of String=('Дата початку контракту не збігається з початковою датою розбивки за періодами сплат',
                                                           'Дата начала контракта не совпадает с начальной датой разбивки по периодам оплат');
const  bs_NoDateEndVSEndRozbivka   :array[1..2] of String=('Дата закінчення контракту не збігається з кінцевою датою розбивки за періодами сплат',
                                                           'Дата окончания контракта не совпадает с конечной датой разбивки по периодам оплат');

const  bs_PeriodsLessDateStart     :array[1..2] of String=('Дати за періодами повинні бути більше, ніж дата старту системи!','Даты по периодам оплат должны быть больше, чем дата запуска системы!');

const  bs_DateBegNeedMoreDateEnd   :array[1..2] of String=('Дата закінчення повинна бути бульше, ніж дата початку!','Дата окончания должна быть больше даты начала!');
const  bs_DatesExists              :array[1..2] of String=('Вже існуює період розбивки з аналогічними датами початку та закінчення!','Уже существует период разбивки с аналогичными датами начала и окончания!');

const  bs_AcademicPeriodsCheck     :array[1..2] of String=('Період не може перевищувати 1 академічний рік!','Период не может превышать 1 академический год!');

const  bs_record_exist             :array[1..2] of String=('Такий запис вже існує !','Такая запись уже существует !');
const  bs_smet_Need                :array[1..2] of String=('Бюджет не заповнений. Продовжити ?','Бюджет не заполненный. Продолжить ?');

const  bs_NotCorrectCode           :array[1..2] of String=('Введено невірний код', 'Введен неверный код');
const  bs_NotCorrectSmeta          :array[1..2] of String=('Код кошторису введено невірно. Даного кошторису не існує', 'Код сметы набран неверно. Данной сметы  не существует');
const  bs_NotCorrectRazdel         :array[1..2] of String=('Код розділу введено невірно. Даного розділу не існує', 'Код раздела набран неверно. Данного раздела не существует');
const  bs_NotCorrectStat           :array[1..2] of String=('Код статті введено невірно. Даної статті не існує', 'Код статьи набран неверно. Данной статьи не существует');
const  bs_NotCorrectKekv           :array[1..2] of String=('Код КЕКВ введено невірно. Даного КЕКВ не існує', 'Код КЕКЗ набран неверно. Данного КЕКЗ не существует');

const  bs_NeedNumber_Smeta  :array[1..2] of String=('Введіть номер кошторису', 'Введите номер сметы');
const  bs_NeedNumber_Razdel :array[1..2] of String=('Введіть номер розділу', 'Введите номер раздела');
const  bs_NeedNumber_Stat   :array[1..2] of String=('Введіть номер статті', 'Введите номер статьи');
const  bs_NeedNumber_KEKV   :array[1..2] of String=('Введіть номер КЕКВ', 'Введите номер КЭКЗ');
const  bs_NotCorrect_summa  :array[1..2] of String=('Сума відрахувань введена невірно', 'Сумма отчислений введена неверно');
const  bs_NotNull_Summa     :array[1..2] of String=('Сума відрахувань не може бути нульовою', 'Сумма отчислений не может быть нулевой');
const  bs_mess_Code_need    :array[1..2] of String=('Введений код не вірний', 'Введен неверный код');
const  bs_NotCorrect_Istoch :array[1..2] of String=('Сполучення кошторис-розділ-стаття введено невірно. Внесіть зміни', 'Сочетание смета-раздел-статья неверно. Внесите изменения');


const bs_NeedFillAllField  : array[1..2] of String=('Необхідно заповнити всі поля!', 'Необходимо заполнить все поля!');

//----------------------Справочник типов водомеров
 const bs_hydrometer_type_del  : array[1..2] of String=('Ви дійсно бажаєте видалити тип водоміра', 'Вы действительно хотите удалить тип водомера');

//----------------------Справочник видов водомеров
const bs_hydrometer_vid_del  : array[1..2] of String=('Ви дійсно бажаєте видалити вид водоміра', 'Вы действительно хотите удалить вид водомера');

//----------------------Справочник типов водомеров
 const bs_document_type_del  : array[1..2] of String=('Ви дійсно бажаєте видалити тип документу', 'Вы действительно хотите удалить тип документа');

implementation

end.
