{*******************************************************************************
* uDepartmentsConsts                                                           *
*                                                                              *
* Константы справочника подразделений                                          *
* Copyright ©  2002-2005, Олег Г. Волков, Донецкий Национальный Университет    *
*******************************************************************************}

unit uDepartmentsConsts;

interface

const
    DefaultDepType = 3;

implementation

end.
